keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxMcds_bf.h
/** \\brief  Offset for Ifx_MCDS_CNT_CCL_Bits.ILV0 */
#define IFX_MCDS_CNT_CCL_ILV0_OFF (7)

/** \\brief  Length for Ifx_MCDS_CNT_CCL_Bits.ILV1 */
#define IFX_MCDS_CNT_CCL_ILV1_LEN (1)

/** \\brief  Mask for Ifx_MCDS_CNT_CCL_Bits.ILV1 */
#define IFX_MCDS_CNT_CCL_ILV1_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_CNT_CCL_Bits.ILV1 */
#define IFX_MCDS_CNT_CCL_ILV1_OFF (23)

/** \\brief  Length for Ifx_MCDS_CNT_CCL_Bits.INC0 */
#define IFX_MCDS_CNT_CCL_INC0_LEN (7)

/** \\brief  Mask for Ifx_MCDS_CNT_CCL_Bits.INC0 */
#define IFX_MCDS_CNT_CCL_INC0_MSK (0x7f)

/** \\brief  Offset for Ifx_MCDS_CNT_CCL_Bits.INC0 */
#define IFX_MCDS_CNT_CCL_INC0_OFF (0)

/** \\brief  Length for Ifx_MCDS_CNT_CCL_Bits.INC1 */
#define IFX_MCDS_CNT_CCL_INC1_LEN (7)

/** \\brief  Mask for Ifx_MCDS_CNT_CCL_Bits.INC1 */
#define IFX_MCDS_CNT_CCL_INC1_MSK (0x7f)

/** \\brief  Offset for Ifx_MCDS_CNT_CCL_Bits.INC1 */
#define IFX_MCDS_CNT_CCL_INC1_OFF (16)

/** \\brief  Length for Ifx_MCDS_CNT_CNT_Bits.COUNT */
#define IFX_MCDS_CNT_CNT_COUNT_LEN (16)

/** \\brief  Mask for Ifx_MCDS_CNT_CNT_Bits.COUNT */
#define IFX_MCDS_CNT_CNT_COUNT_MSK (0xffff)

/** \\brief  Offset for Ifx_MCDS_CNT_CNT_Bits.COUNT */
#define IFX_MCDS_CNT_CNT_COUNT_OFF (0)

/** \\brief  Length for Ifx_MCDS_CNT_LMT_Bits.LIMIT */
#define IFX_MCDS_CNT_LMT_LIMIT_LEN (16)

/** \\brief  Mask for Ifx_MCDS_CNT_LMT_Bits.LIMIT */
#define IFX_MCDS_CNT_LMT_LIMIT_MSK (0xffff)

/** \\brief  Offset for Ifx_MCDS_CNT_LMT_Bits.LIMIT */
#define IFX_MCDS_CNT_LMT_LIMIT_OFF (0)

/** \\brief  Length for Ifx_MCDS_CNT_LMT_Bits.MOD0 */
#define IFX_MCDS_CNT_LMT_MOD0_LEN (1)

/** \\brief  Mask for Ifx_MCDS_CNT_LMT_Bits.MOD0 */
#define IFX_MCDS_CNT_LMT_MOD0_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_CNT_LMT_Bits.MOD0 */
#define IFX_MCDS_CNT_LMT_MOD0_OFF (30)

/** \\brief  Length for Ifx_MCDS_CNT_LMT_Bits.MOD1 */
#define IFX_MCDS_CNT_LMT_MOD1_LEN (1)

/** \\brief  Mask for Ifx_MCDS_CNT_LMT_Bits.MOD1 */
#define IFX_MCDS_CNT_LMT_MOD1_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_CNT_LMT_Bits.MOD1 */
#define IFX_MCDS_CNT_LMT_MOD1_OFF (31)

/** \\brief  Length for Ifx_MCDS_CT_Bits.BED */
#define IFX_MCDS_CT_BED_LEN (1)

/** \\brief  Mask for Ifx_MCDS_CT_Bits.BED */
#define IFX_MCDS_CT_BED_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_CT_Bits.BED */
#define IFX_MCDS_CT_BED_OFF (16)

/** \\brief  Length for Ifx_MCDS_CT_Bits.BED_P */
#define IFX_MCDS_CT_BED_P_LEN (1)

/** \\brief  Mask for Ifx_MCDS_CT_Bits.BED_P */
#define IFX_MCDS_CT_BED_P_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_CT_Bits.BED_P */
#define IFX_MCDS_CT_BED_P_OFF (19)

/** \\brief  Length for Ifx_MCDS_CT_Bits.CLRE */
#define IFX_MCDS_CT_CLRE_LEN (1)

/** \\brief  Mask for Ifx_MCDS_CT_Bits.CLRE */
#define IFX_MCDS_CT_CLRE_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_CT_Bits.CLRE */
#define IFX_MCDS_CT_CLRE_OFF (14)

/** \\brief  Length for Ifx_MCDS_CT_Bits.CLRI */
#define IFX_MCDS_CT_CLRI_LEN (1)

/** \\brief  Mask for Ifx_MCDS_CT_Bits.CLRI */
#define IFX_MCDS_CT_CLRI_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_CT_Bits.CLRI */
#define IFX_MCDS_CT_CLRI_OFF (22)

/** \\brief  Length for Ifx_MCDS_CT_Bits.EN */
#define IFX_MCDS_CT_EN_LEN (1)

/** \\brief  Mask for Ifx_MCDS_CT_Bits.EN */
#define IFX_MCDS_CT_EN_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_CT_Bits.EN */
#define IFX_MCDS_CT_EN_OFF (13)

/** \\brief  Length for Ifx_MCDS_CT_Bits.IRA */
#define IFX_MCDS_CT_IRA_LEN (1)

/** \\brief  Mask for Ifx_MCDS_CT_Bits.IRA */
#define IFX_MCDS_CT_IRA_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_CT_Bits.IRA */
#define IFX_MCDS_CT_IRA_OFF (21)

/** \\brief  Length for Ifx_MCDS_CT_Bits.IWA */
#define IFX_MCDS_CT_IWA_LEN (1)

/** \\brief  Mask for Ifx_MCDS_CT_Bits.IWA */
#define IFX_MCDS_CT_IWA_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_CT_Bits.IWA */
#define IFX_MCDS_CT_IWA_OFF (23)

/** \\brief  Length for Ifx_MCDS_CT_Bits.RES */
#define IFX_MCDS_CT_RES_LEN (1)

/** \\brief  Mask for Ifx_MCDS_CT_Bits.RES */
#define IFX_MCDS_CT_RES_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_CT_Bits.RES */
#define IFX_MCDS_CT_RES_OFF (29)

/** \\brief  Length for Ifx_MCDS_CT_Bits.SETE */
#define IFX_MCDS_CT_SETE_LEN (1)

/** \\brief  Mask for Ifx_MCDS_CT_Bits.SETE */
#define IFX_MCDS_CT_SETE_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_CT_Bits.SETE */
#define IFX_MCDS_CT_SETE_OFF (15)

/** \\brief  Length for Ifx_MCDS_CT_Bits.SETR */
#define IFX_MCDS_CT_SETR_LEN (1)

/** \\brief  Mask for Ifx_MCDS_CT_Bits.SETR */
#define IFX_MCDS_CT_SETR_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_CT_Bits.SETR */
#define IFX_MCDS_CT_SETR_OFF (31)

/** \\brief  Length for Ifx_MCDS_EVT_Bits.EIQ0 */
#define IFX_MCDS_EVT_EIQ0_LEN (2)

/** \\brief  Mask for Ifx_MCDS_EVT_Bits.EIQ0 */
#define IFX_MCDS_EVT_EIQ0_MSK (0x3)

/** \\brief  Offset for Ifx_MCDS_EVT_Bits.EIQ0 */
#define IFX_MCDS_EVT_EIQ0_OFF (0)

/** \\brief  Length for Ifx_MCDS_EVT_Bits.EIQ10 */
#define IFX_MCDS_EVT_EIQ10_LEN (2)

/** \\brief  Mask for Ifx_MCDS_EVT_Bits.EIQ10 */
#define IFX_MCDS_EVT_EIQ10_MSK (0x3)

/** \\brief  Offset for Ifx_MCDS_EVT_Bits.EIQ10 */
#define IFX_MCDS_EVT_EIQ10_OFF (20)

/** \\brief  Length for Ifx_MCDS_EVT_Bits.EIQ11 */
#define IFX_MCDS_EVT_EIQ11_LEN (2)

/** \\brief  Mask for Ifx_MCDS_EVT_Bits.EIQ11 */
#define IFX_MCDS_EVT_EIQ11_MSK (0x3)

/** \\brief  Offset for Ifx_MCDS_EVT_Bits.EIQ11 */
#define IFX_MCDS_EVT_EIQ11_OFF (22)

/** \\brief  Length for Ifx_MCDS_EVT_Bits.EIQ12 */
#define IFX_MCDS_EVT_EIQ12_LEN (2)

/** \\brief  Mask for Ifx_MCDS_EVT_Bits.EIQ12 */
#define IFX_MCDS_EVT_EIQ12_MSK (0x3)

/** \\brief  Offset for Ifx_MCDS_EVT_Bits.EIQ12 */
#define IFX_MCDS_EVT_EIQ12_OFF (24)

/** \\brief  Length for Ifx_MCDS_EVT_Bits.EIQ13 */
#define IFX_MCDS_EVT_EIQ13_LEN (2)

/** \\brief  Mask for Ifx_MCDS_EVT_Bits.EIQ13 */
#define IFX_MCDS_EVT_EIQ13_MSK (0x3)

/** \\brief  Offset for Ifx_MCDS_EVT_Bits.EIQ13 */
#define IFX_MCDS_EVT_EIQ13_OFF (26)

/** \\brief  Length for Ifx_MCDS_EVT_Bits.EIQ14 */
#define IFX_MCDS_EVT_EIQ14_LEN (2)

/** \\brief  Mask for Ifx_MCDS_EVT_Bits.EIQ14 */
#define IFX_MCDS_EVT_EIQ14_MSK (0x3)

