keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxMcds_bf.h
/** \\brief  Length for Ifx_MCDS_FIFOWARN0_Bits.OCDEN */
#define IFX_MCDS_FIFOWARN0_OCDEN_LEN (1)

/** \\brief  Mask for Ifx_MCDS_FIFOWARN0_Bits.OCDEN */
#define IFX_MCDS_FIFOWARN0_OCDEN_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_FIFOWARN0_Bits.OCDEN */
#define IFX_MCDS_FIFOWARN0_OCDEN_OFF (30)

/** \\brief  Length for Ifx_MCDS_FIFOWARN0_Bits.WARN */
#define IFX_MCDS_FIFOWARN0_WARN_LEN (15)

/** \\brief  Mask for Ifx_MCDS_FIFOWARN0_Bits.WARN */
#define IFX_MCDS_FIFOWARN0_WARN_MSK (0x7fff)

/** \\brief  Offset for Ifx_MCDS_FIFOWARN0_Bits.WARN */
#define IFX_MCDS_FIFOWARN0_WARN_OFF (5)

/** \\brief  Length for Ifx_MCDS_FIFOWARN1_Bits.EN */
#define IFX_MCDS_FIFOWARN1_EN_LEN (1)

/** \\brief  Mask for Ifx_MCDS_FIFOWARN1_Bits.EN */
#define IFX_MCDS_FIFOWARN1_EN_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_FIFOWARN1_Bits.EN */
#define IFX_MCDS_FIFOWARN1_EN_OFF (31)

/** \\brief  Length for Ifx_MCDS_FIFOWARN1_Bits.OCDEN */
#define IFX_MCDS_FIFOWARN1_OCDEN_LEN (1)

/** \\brief  Mask for Ifx_MCDS_FIFOWARN1_Bits.OCDEN */
#define IFX_MCDS_FIFOWARN1_OCDEN_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_FIFOWARN1_Bits.OCDEN */
#define IFX_MCDS_FIFOWARN1_OCDEN_OFF (30)

/** \\brief  Length for Ifx_MCDS_FIFOWARN1_Bits.WARN */
#define IFX_MCDS_FIFOWARN1_WARN_LEN (15)

/** \\brief  Mask for Ifx_MCDS_FIFOWARN1_Bits.WARN */
#define IFX_MCDS_FIFOWARN1_WARN_MSK (0x7fff)

/** \\brief  Offset for Ifx_MCDS_FIFOWARN1_Bits.WARN */
#define IFX_MCDS_FIFOWARN1_WARN_OFF (5)

/** \\brief  Length for Ifx_MCDS_ID_Bits.MOD_REV */
#define IFX_MCDS_ID_MOD_REV_LEN (8)

/** \\brief  Mask for Ifx_MCDS_ID_Bits.MOD_REV */
#define IFX_MCDS_ID_MOD_REV_MSK (0xff)

/** \\brief  Offset for Ifx_MCDS_ID_Bits.MOD_REV */
#define IFX_MCDS_ID_MOD_REV_OFF (0)

/** \\brief  Length for Ifx_MCDS_ID_Bits.MOD_TYPE */
#define IFX_MCDS_ID_MOD_TYPE_LEN (8)

/** \\brief  Mask for Ifx_MCDS_ID_Bits.MOD_TYPE */
#define IFX_MCDS_ID_MOD_TYPE_MSK (0xff)

/** \\brief  Offset for Ifx_MCDS_ID_Bits.MOD_TYPE */
#define IFX_MCDS_ID_MOD_TYPE_OFF (8)

/** \\brief  Length for Ifx_MCDS_ID_Bits.MODNUMBER */
#define IFX_MCDS_ID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_MCDS_ID_Bits.MODNUMBER */
#define IFX_MCDS_ID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_MCDS_ID_Bits.MODNUMBER */
#define IFX_MCDS_ID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_MCDS_MUX_Bits.RC */
#define IFX_MCDS_MUX_RC_LEN (1)

/** \\brief  Mask for Ifx_MCDS_MUX_Bits.RC */
#define IFX_MCDS_MUX_RC_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_MUX_Bits.RC */
#define IFX_MCDS_MUX_RC_OFF (24)

/** \\brief  Length for Ifx_MCDS_MUX_Bits.RC_P */
#define IFX_MCDS_MUX_RC_P_LEN (1)

/** \\brief  Mask for Ifx_MCDS_MUX_Bits.RC_P */
#define IFX_MCDS_MUX_RC_P_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_MUX_Bits.RC_P */
#define IFX_MCDS_MUX_RC_P_OFF (27)

/** \\brief  Length for Ifx_MCDS_MUX_Bits.TM0_P */
#define IFX_MCDS_MUX_TM0_P_LEN (1)

/** \\brief  Mask for Ifx_MCDS_MUX_Bits.TM0_P */
#define IFX_MCDS_MUX_TM0_P_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_MUX_Bits.TM0_P */
#define IFX_MCDS_MUX_TM0_P_OFF (7)

/** \\brief  Length for Ifx_MCDS_MUX_Bits.TM1_P */
#define IFX_MCDS_MUX_TM1_P_LEN (1)

/** \\brief  Mask for Ifx_MCDS_MUX_Bits.TM1_P */
#define IFX_MCDS_MUX_TM1_P_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_MUX_Bits.TM1_P */
#define IFX_MCDS_MUX_TM1_P_OFF (15)

/** \\brief  Length for Ifx_MCDS_MUX_Bits.TM2_P */
#define IFX_MCDS_MUX_TM2_P_LEN (1)

/** \\brief  Mask for Ifx_MCDS_MUX_Bits.TM2_P */
#define IFX_MCDS_MUX_TM2_P_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_MUX_Bits.TM2_P */
#define IFX_MCDS_MUX_TM2_P_OFF (19)

/** \\brief  Length for Ifx_MCDS_MUX_Bits.TM3_P */
#define IFX_MCDS_MUX_TM3_P_LEN (1)

/** \\brief  Mask for Ifx_MCDS_MUX_Bits.TM3_P */
#define IFX_MCDS_MUX_TM3_P_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_MUX_Bits.TM3_P */
#define IFX_MCDS_MUX_TM3_P_OFF (23)

/** \\brief  Length for Ifx_MCDS_MUX_Bits.TMUX0 */
#define IFX_MCDS_MUX_TMUX0_LEN (4)

/** \\brief  Mask for Ifx_MCDS_MUX_Bits.TMUX0 */
#define IFX_MCDS_MUX_TMUX0_MSK (0xf)

/** \\brief  Offset for Ifx_MCDS_MUX_Bits.TMUX0 */
#define IFX_MCDS_MUX_TMUX0_OFF (0)

/** \\brief  Length for Ifx_MCDS_MUX_Bits.TMUX1 */
#define IFX_MCDS_MUX_TMUX1_LEN (4)

/** \\brief  Mask for Ifx_MCDS_MUX_Bits.TMUX1 */
#define IFX_MCDS_MUX_TMUX1_MSK (0xf)

/** \\brief  Offset for Ifx_MCDS_MUX_Bits.TMUX1 */
#define IFX_MCDS_MUX_TMUX1_OFF (8)

/** \\brief  Length for Ifx_MCDS_MUX_Bits.TMUX2 */
#define IFX_MCDS_MUX_TMUX2_LEN (3)

/** \\brief  Mask for Ifx_MCDS_MUX_Bits.TMUX2 */
#define IFX_MCDS_MUX_TMUX2_MSK (0x7)

/** \\brief  Offset for Ifx_MCDS_MUX_Bits.TMUX2 */
#define IFX_MCDS_MUX_TMUX2_OFF (16)

/** \\brief  Length for Ifx_MCDS_MUX_Bits.TMUX3 */
#define IFX_MCDS_MUX_TMUX3_LEN (3)

/** \\brief  Mask for Ifx_MCDS_MUX_Bits.TMUX3 */
#define IFX_MCDS_MUX_TMUX3_MSK (0x7)

/** \\brief  Offset for Ifx_MCDS_MUX_Bits.TMUX3 */
#define IFX_MCDS_MUX_TMUX3_OFF (20)

/** \\brief  Length for Ifx_MCDS_OCS_Bits.SUS */
#define IFX_MCDS_OCS_SUS_LEN (4)

/** \\brief  Mask for Ifx_MCDS_OCS_Bits.SUS */
#define IFX_MCDS_OCS_SUS_MSK (0xf)

/** \\brief  Offset for Ifx_MCDS_OCS_Bits.SUS */
#define IFX_MCDS_OCS_SUS_OFF (24)

/** \\brief  Length for Ifx_MCDS_OCS_Bits.SUS_P */
#define IFX_MCDS_OCS_SUS_P_LEN (1)

/** \\brief  Mask for Ifx_MCDS_OCS_Bits.SUS_P */
#define IFX_MCDS_OCS_SUS_P_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_OCS_Bits.SUS_P */
#define IFX_MCDS_OCS_SUS_P_OFF (28)

/** \\brief  Length for Ifx_MCDS_OCS_Bits.SUSSTA */
#define IFX_MCDS_OCS_SUSSTA_LEN (1)

/** \\brief  Mask for Ifx_MCDS_OCS_Bits.SUSSTA */
#define IFX_MCDS_OCS_SUSSTA_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_OCS_Bits.SUSSTA */
#define IFX_MCDS_OCS_SUSSTA_OFF (29)

/** \\brief  Length for Ifx_MCDS_TCX_CIP_Bits.CURRENT */
#define IFX_MCDS_TCX_CIP_CURRENT_LEN (31)

/** \\brief  Mask for Ifx_MCDS_TCX_CIP_Bits.CURRENT */
#define IFX_MCDS_TCX_CIP_CURRENT_MSK (0x7fffffff)

/** \\brief  Offset for Ifx_MCDS_TCX_CIP_Bits.CURRENT */
#define IFX_MCDS_TCX_CIP_CURRENT_OFF (1)

/** \\brief  Length for Ifx_MCDS_TCX_DCSTS_Bits.CLKDIV */
#define IFX_MCDS_TCX_DCSTS_CLKDIV_LEN (2)

/** \\brief  Mask for Ifx_MCDS_TCX_DCSTS_Bits.CLKDIV */
#define IFX_MCDS_TCX_DCSTS_CLKDIV_MSK (0x3)

/** \\brief  Offset for Ifx_MCDS_TCX_DCSTS_Bits.CLKDIV */
#define IFX_MCDS_TCX_DCSTS_CLKDIV_OFF (9)

/** \\brief  Length for Ifx_MCDS_TCX_DCSTS_Bits.DBGEN */
#define IFX_MCDS_TCX_DCSTS_DBGEN_LEN (1)

