keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxMcds_bf.h
/** \\brief  Mask for Ifx_MCDS_TCX_DCSTS_Bits.DBGEN */
#define IFX_MCDS_TCX_DCSTS_DBGEN_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_TCX_DCSTS_Bits.DBGEN */
#define IFX_MCDS_TCX_DCSTS_DBGEN_OFF (8)

/** \\brief  Length for Ifx_MCDS_TCX_DCSTS_Bits.HALT */
#define IFX_MCDS_TCX_DCSTS_HALT_LEN (1)

/** \\brief  Mask for Ifx_MCDS_TCX_DCSTS_Bits.HALT */
#define IFX_MCDS_TCX_DCSTS_HALT_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_TCX_DCSTS_Bits.HALT */
#define IFX_MCDS_TCX_DCSTS_HALT_OFF (2)

/** \\brief  Length for Ifx_MCDS_TCX_DCSTS_Bits.HBRK */
#define IFX_MCDS_TCX_DCSTS_HBRK_LEN (1)

/** \\brief  Mask for Ifx_MCDS_TCX_DCSTS_Bits.HBRK */
#define IFX_MCDS_TCX_DCSTS_HBRK_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_TCX_DCSTS_Bits.HBRK */
#define IFX_MCDS_TCX_DCSTS_HBRK_OFF (4)

/** \\brief  Length for Ifx_MCDS_TCX_DCSTS_Bits.IDLE */
#define IFX_MCDS_TCX_DCSTS_IDLE_LEN (1)

/** \\brief  Mask for Ifx_MCDS_TCX_DCSTS_Bits.IDLE */
#define IFX_MCDS_TCX_DCSTS_IDLE_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_TCX_DCSTS_Bits.IDLE */
#define IFX_MCDS_TCX_DCSTS_IDLE_OFF (1)

/** \\brief  Length for Ifx_MCDS_TCX_DCSTS_Bits.IEN */
#define IFX_MCDS_TCX_DCSTS_IEN_LEN (1)

/** \\brief  Mask for Ifx_MCDS_TCX_DCSTS_Bits.IEN */
#define IFX_MCDS_TCX_DCSTS_IEN_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_TCX_DCSTS_Bits.IEN */
#define IFX_MCDS_TCX_DCSTS_IEN_OFF (7)

/** \\brief  Length for Ifx_MCDS_TCX_DCSTS_Bits.ISR */
#define IFX_MCDS_TCX_DCSTS_ISR_LEN (1)

/** \\brief  Mask for Ifx_MCDS_TCX_DCSTS_Bits.ISR */
#define IFX_MCDS_TCX_DCSTS_ISR_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_TCX_DCSTS_Bits.ISR */
#define IFX_MCDS_TCX_DCSTS_ISR_OFF (3)

/** \\brief  Length for Ifx_MCDS_TCX_DCSTS_Bits.SBRK */
#define IFX_MCDS_TCX_DCSTS_SBRK_LEN (1)

/** \\brief  Mask for Ifx_MCDS_TCX_DCSTS_Bits.SBRK */
#define IFX_MCDS_TCX_DCSTS_SBRK_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_TCX_DCSTS_Bits.SBRK */
#define IFX_MCDS_TCX_DCSTS_SBRK_OFF (5)

/** \\brief  Length for Ifx_MCDS_TCX_DCSTS_Bits.SUS */
#define IFX_MCDS_TCX_DCSTS_SUS_LEN (1)

/** \\brief  Mask for Ifx_MCDS_TCX_DCSTS_Bits.SUS */
#define IFX_MCDS_TCX_DCSTS_SUS_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_TCX_DCSTS_Bits.SUS */
#define IFX_MCDS_TCX_DCSTS_SUS_OFF (0)

/** \\brief  Length for Ifx_MCDS_TCX_TCCFTREG_Bits.SHRT_FCT */
#define IFX_MCDS_TCX_TCCFTREG_SHRT_FCT_LEN (8)

/** \\brief  Mask for Ifx_MCDS_TCX_TCCFTREG_Bits.SHRT_FCT */
#define IFX_MCDS_TCX_TCCFTREG_SHRT_FCT_MSK (0xff)

/** \\brief  Offset for Ifx_MCDS_TCX_TCCFTREG_Bits.SHRT_FCT */
#define IFX_MCDS_TCX_TCCFTREG_SHRT_FCT_OFF (16)

/** \\brief  Length for Ifx_MCDS_TCX_TCCFTREG_Bits.VSHRT_FCT */
#define IFX_MCDS_TCX_TCCFTREG_VSHRT_FCT_LEN (8)

/** \\brief  Mask for Ifx_MCDS_TCX_TCCFTREG_Bits.VSHRT_FCT */
#define IFX_MCDS_TCX_TCCFTREG_VSHRT_FCT_MSK (0xff)

/** \\brief  Offset for Ifx_MCDS_TCX_TCCFTREG_Bits.VSHRT_FCT */
#define IFX_MCDS_TCX_TCCFTREG_VSHRT_FCT_OFF (0)

/** \\brief  Length for Ifx_MCDS_TCXEA_BND_Bits.BOUND */
#define IFX_MCDS_TCXEA_BND_BOUND_LEN (32)

/** \\brief  Mask for Ifx_MCDS_TCXEA_BND_Bits.BOUND */
#define IFX_MCDS_TCXEA_BND_BOUND_MSK (0xffffffff)

/** \\brief  Offset for Ifx_MCDS_TCXEA_BND_Bits.BOUND */
#define IFX_MCDS_TCXEA_BND_BOUND_OFF (0)

/** \\brief  Length for Ifx_MCDS_TCXEA_RNG_Bits.RANGE */
#define IFX_MCDS_TCXEA_RNG_RANGE_LEN (32)

/** \\brief  Mask for Ifx_MCDS_TCXEA_RNG_Bits.RANGE */
#define IFX_MCDS_TCXEA_RNG_RANGE_MSK (0xffffffff)

/** \\brief  Offset for Ifx_MCDS_TCXEA_RNG_Bits.RANGE */
#define IFX_MCDS_TCXEA_RNG_RANGE_OFF (0)

/** \\brief  Length for Ifx_MCDS_TCXIP_BND_Bits.BOUND */
#define IFX_MCDS_TCXIP_BND_BOUND_LEN (31)

/** \\brief  Mask for Ifx_MCDS_TCXIP_BND_Bits.BOUND */
#define IFX_MCDS_TCXIP_BND_BOUND_MSK (0x7fffffff)

/** \\brief  Offset for Ifx_MCDS_TCXIP_BND_Bits.BOUND */
#define IFX_MCDS_TCXIP_BND_BOUND_OFF (1)

/** \\brief  Length for Ifx_MCDS_TCXIP_RNG_Bits.RANGE */
#define IFX_MCDS_TCXIP_RNG_RANGE_LEN (31)

/** \\brief  Mask for Ifx_MCDS_TCXIP_RNG_Bits.RANGE */
#define IFX_MCDS_TCXIP_RNG_RANGE_MSK (0x7fffffff)

/** \\brief  Offset for Ifx_MCDS_TCXIP_RNG_Bits.RANGE */
#define IFX_MCDS_TCXIP_RNG_RANGE_OFF (1)

/** \\brief  Length for Ifx_MCDS_TCXWD_BND_Bits.BOUND */
#define IFX_MCDS_TCXWD_BND_BOUND_LEN (32)

/** \\brief  Mask for Ifx_MCDS_TCXWD_BND_Bits.BOUND */
#define IFX_MCDS_TCXWD_BND_BOUND_MSK (0xffffffff)

/** \\brief  Offset for Ifx_MCDS_TCXWD_BND_Bits.BOUND */
#define IFX_MCDS_TCXWD_BND_BOUND_OFF (0)

/** \\brief  Length for Ifx_MCDS_TCXWD_MSK_Bits.MASK */
#define IFX_MCDS_TCXWD_MSK_MASK_LEN (32)

/** \\brief  Mask for Ifx_MCDS_TCXWD_MSK_Bits.MASK */
#define IFX_MCDS_TCXWD_MSK_MASK_MSK (0xffffffff)

/** \\brief  Offset for Ifx_MCDS_TCXWD_MSK_Bits.MASK */
#define IFX_MCDS_TCXWD_MSK_MASK_OFF (0)

/** \\brief  Length for Ifx_MCDS_TCXWD_RNG_Bits.RANGE */
#define IFX_MCDS_TCXWD_RNG_RANGE_LEN (32)

/** \\brief  Mask for Ifx_MCDS_TCXWD_RNG_Bits.RANGE */
#define IFX_MCDS_TCXWD_RNG_RANGE_MSK (0xffffffff)

/** \\brief  Offset for Ifx_MCDS_TCXWD_RNG_Bits.RANGE */
#define IFX_MCDS_TCXWD_RNG_RANGE_OFF (0)

/** \\brief  Length for Ifx_MCDS_TCXWD_SGN_Bits.BELOW */
#define IFX_MCDS_TCXWD_SGN_BELOW_LEN (1)

/** \\brief  Mask for Ifx_MCDS_TCXWD_SGN_Bits.BELOW */
#define IFX_MCDS_TCXWD_SGN_BELOW_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_TCXWD_SGN_Bits.BELOW */
#define IFX_MCDS_TCXWD_SGN_BELOW_OFF (15)

/** \\brief  Length for Ifx_MCDS_TCXWD_SGN_Bits.EITHER */
#define IFX_MCDS_TCXWD_SGN_EITHER_LEN (1)

/** \\brief  Mask for Ifx_MCDS_TCXWD_SGN_Bits.EITHER */
#define IFX_MCDS_TCXWD_SGN_EITHER_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_TCXWD_SGN_Bits.EITHER */
#define IFX_MCDS_TCXWD_SGN_EITHER_OFF (14)

/** \\brief  Length for Ifx_MCDS_TCXWD_SGN_Bits.RELOAD */
#define IFX_MCDS_TCXWD_SGN_RELOAD_LEN (4)

/** \\brief  Mask for Ifx_MCDS_TCXWD_SGN_Bits.RELOAD */
#define IFX_MCDS_TCXWD_SGN_RELOAD_MSK (0xf)

/** \\brief  Offset for Ifx_MCDS_TCXWD_SGN_Bits.RELOAD */
#define IFX_MCDS_TCXWD_SGN_RELOAD_OFF (16)

/** \\brief  Length for Ifx_MCDS_TCXWD_SGN_Bits.SIGN */
#define IFX_MCDS_TCXWD_SGN_SIGN_LEN (6)

/** \\brief  Mask for Ifx_MCDS_TCXWD_SGN_Bits.SIGN */
#define IFX_MCDS_TCXWD_SGN_SIGN_MSK (0x3f)

/** \\brief  Offset for Ifx_MCDS_TCXWD_SGN_Bits.SIGN */
#define IFX_MCDS_TCXWD_SGN_SIGN_OFF (0)

/** \\brief  Length for Ifx_MCDS_TSUEMUCNT_Bits.COUNT */
#define IFX_MCDS_TSUEMUCNT_COUNT_LEN (32)

/** \\brief  Mask for Ifx_MCDS_TSUEMUCNT_Bits.COUNT */
#define IFX_MCDS_TSUEMUCNT_COUNT_MSK (0xffffffff)

/** \\brief  Offset for Ifx_MCDS_TSUEMUCNT_Bits.COUNT */
#define IFX_MCDS_TSUEMUCNT_COUNT_OFF (0)

/** \\brief  Length for Ifx_MCDS_TSUPRSCL_Bits.RELOAD */
#define IFX_MCDS_TSUPRSCL_RELOAD_LEN (32)

/** \\brief  Mask for Ifx_MCDS_TSUPRSCL_Bits.RELOAD */
#define IFX_MCDS_TSUPRSCL_RELOAD_MSK (0xffffffff)

/** \\brief  Offset for Ifx_MCDS_TSUPRSCL_Bits.RELOAD */
#define IFX_MCDS_TSUPRSCL_RELOAD_OFF (0)

/** \\brief  Length for Ifx_MCDS_TSUREFCNT_Bits.COUNT */
#define IFX_MCDS_TSUREFCNT_COUNT_LEN (32)

/** \\brief  Mask for Ifx_MCDS_TSUREFCNT_Bits.COUNT */
#define IFX_MCDS_TSUREFCNT_COUNT_MSK (0xffffffff)

/** \\brief  Offset for Ifx_MCDS_TSUREFCNT_Bits.COUNT */
#define IFX_MCDS_TSUREFCNT_COUNT_OFF (0)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXMCDS_BF_H */
